package by.itstep.javatraining.revision.task;

/*  Task 04. The Leap Year [високосный год]
 *
 *  Определите, является ли заданный год високосным (как нашей эры, так и до нашей эры).
 *  Год является високосным, если его номер кратен 4, но не кратен 100, или если он кратен 400.
 *
 *  Примечание
 *  1) Не забудьте про "защиту от дурака": если данные некорректны,
 *  то нужно возвратить false.
 *  2) Данную задачу можно решить, используя только встроенные операции
 *  языка, а сам алгоритм реализовать в одну строчку.
 *
 *  Формат входных данных [input]
 *  На вход метод получает целое число типа int.
 *
 *  Формат выходных данных [output]
 *  Метод должен возвратить результат в виде булевского значения.
 *
 *	[ input 1]: 2023
 *	[output 1]: false
 *
 *	[ input 2]: 1984
 *	[output 2]: true
 *
 *	[ input 3]: 2000
 *	[output 3]: true
 *
 *	[ input 4]: 0
 *	[output 4]: true
 *
 *	[ input 5]: -100
 *	[output 5]: false
 */

public class Task04 {
	public static boolean start(int year) {
		if ((year % 4 == 0 && year % 100 != 0) || year % 400 == 0) {
			return true;
		}

		return false;
	}
}